{
	"@metadata": [],
	"abort": "Abortar",
	"remove": "Remover",
	"restart": "Reiniciar",
	"next": "Siguiente",
	"loading": "CARGANDO...",
	"confirm": "Confirmar",
	"errorTooLarge": "El archivo es demasiado grande para subir directamente! Podrías hacer una {{#a}}petición de subida en server-side upload{{/a}}.",
	"addTask": "Agregar tarea...",
	"yourTasks": "Tus tareas:",
	"createServerSide": "Crear un ticket para subidas en server-side (recomendado)",
	"taskDone": "Tarea completada. Podrías encontrar tu subida en {{#a}}{{/a}}.",
	"cancel": "Cancelar",
	"back": "Atrás",
	"extractor": "Extractor",
	"keep": "Mantener",
	"filetarget": "Nombre",
	"transcoding": "Formato",
	"filedescription": "Descripción",
	"filename": "Nombre de archivo",
	"video": "video",
	"audio": "audio",
	"subtitles": "subtítulos",
	"keepvideo": "Conservar video",
	"keepaudio": "Conservar audio",
	"importsubtitles": "Importar subtitulos",
	"note": "Nota:",
	"importantnote": "Nota importante:",
	"notesplaylists": "Listas de reproducción no se procesarán correctamente. Algunos sitios web (como Youku y Comedy Central) utilizar vídeos divididos en varias partes, interpretado como una lista de reproducción, no serán procesadas correctamente.",
	"notesuncheck": "Si el archivo de media no incluye pistas de audio o de vídeo, por favor, desactive las casillas de verificación correspondientes, de lo contrario la conversión puede fallar, incluso si el formato es libre.",
	"notessubtitles": "Si se marca 'Importar subtítulos', se importarán los subtítulos, a excepción de los auto-generadas.",
	"notesown": "¿Y que si necesito subir y convertir el archivo en mi computador? Pues bien, mientras NFS y el motor de grid esten todavía aquí, puedes usarlos {{#a}}#vc|videoconvert{{/a}} herramienta.",
	"noteslicensing": "Sólo subir {{#a}}#fl|con licencia libre{{/a}} o {{#a}}#pd|dominio público{{/a}} contenido. {{#a}}#fu|Fair use{{/a}}no se me permite en commons.",
	"extensionmsg": "La extensión de archivo seleccionada arriba es usada si y sólo si el vídeo está en formato no-libre, los cuales requieren transcodificación. Vídeos en formatos libres mantendrán sus extensiones.",
	"confirmmsg": "Por favor, confirme la tarea o haga click en 'Atrás' para cambiar los parámetros. Al hacer clic en 'Confirmar', la tarea será enviada y ejecutada. Debido a restricciones técnicas, la tarea no se puede interrumpir con facilidad una vez que comienza."
}
