{
	"@metadata": {
		"authors": [
			"Aue Nai"
		]
	},
	"loginOnCommons": "လုပ်ဇၟိက်ပ္ဍဲ Wikimedia Commons",
	"logout": "တိတ်ဇၟိက်",
	"help": "ရီု",
	"forkOnGitHub": "ဂါပ်အဲပ္ဍဲ GitHub",
	"JavascriptRequired": "JavaScript ဂှ်နွံလဝ်ပၟိက်သွက်ဂွံသုၚ်စောဲကြိယာဏအ်!",
	"abort": "ပလီုဖျေံ",
	"remove": "ပတိတ်",
	"restart": "ကလေၚ်စ",
	"next": "ဂတ",
	"loading": "ပတိုန်ဒၟံၚ်...",
	"confirm": "သ္ပဒတန်",
	"errorDisconnect": "မဆက်စၠောံကဵုဌာန်လာၚ်ဂှ်စှ်ေအာယျ. သ္ပဂုဏ်တုဲ ကလၚ်ပၚုဟ်မုက်လိက် ဟွံသေၚ် ဝှာၚ် မပတိတ်ပ္ဍဲ GitHub.",
	"errorTooLarge": "ကပေါတ်ဏအ်ဇၞော်လောန်အာသွက်ဂွံပတိုန်တိုက်ရိုက်! မၞးထေက်ကဵုဒး{{#a}}အာတ်မိက် ဖိုၚ်လာၚ်ပတိုန်မွဲ {{/a}}.",
	"addTask": "ထပ်ကမၠောန်...",
	"yourTasks": "ကမၠောန်မၞးဂမၠိုၚ်:",
	"createServerSide": "ခၞံကၠောန် ဖိုၚ်-ကၠောန် ပတိုန်စၟတ်တဲပ္ဍဲ မွဲအာ (ကဵုပ္ညုၚ်လဝ်)",
	"taskDone": "ကမၠောန်မၞးတုဲဒှ်. မၞးဂပ်ဝ်ဂၠာဲကေတ်ကပေါတ်မၞး ပ္ဍဲ{{#a}}{{/a}}.",
	"cancel": "တးပဲါ",
	"back": "ကလေင်",
	"extractor": "ပၞိက်ပတိတ်ကျာသမ်အုဲ",
	"keep": "သီဒက်",
	"filetarget": "ဝှာၚ်ယၟုပတဝ်ပွန်",
	"transcoding": "သၞောတ်မကလေၚ်ကှေ်",
	"filedescription": "မုက်လိက် မပံက်ထ္ၜးကပေါတ်",
	"filename": "ယၟုဝှာင်",
	"video": "ရုပ်ဒမျိုၚ်",
	"audio": "ရမျှာၚ်",
	"subtitles": "ထပက်လိက်",
	"keepvideo": "သဳရုပ်ဒမျိုၚ်",
	"keepaudio": "သဳ ရမျှာၚ်",
	"importsubtitles": "စုတ် မုက်လိက်ပါ်",
	"uploadFile": "ဟွံသေၚ် ပတိုန်ကပေါတ်...",
	"uploading": "ပတိုန်ဒၟံၚ်",
	"note": "တၚ်စၟတ်:",
	"importantnote": "တၚ်စၟတ်ကိစ္စဇၞော်:",
	"notesplaylists": "စရၚ်မကၠောန်တအ် ဗွဲမဍာံစၟတ်စှ်ေကေတ်သၞောတ်ဟွံသေၚ်. မုက်လ္ၚဵုတအ် (ဗီုကဵု Youku ကေုာံ Comedy Central ) မကၠောန်တဴနကဵု ရပ်ဒမျိုၚ် အဝဲဂမၠိုၚ်တအ်, ကၠာဲလဝ်နဒဒှ် စရၚ်မကၠောန်, ကေုာံ ဗွဲမဍာံစၟတ် စှ်ေကဵုသၞောတ် ဟွံမာန်ကီု.",
	"notesuncheck": "ယဝ်မဳဒဳယာသီုဟွံပါကေတ် ရုပ်ဒမျိုၚ် ဟွံသေၚ် ကဝးရမျှာၚ်တအ်မ္ဂး, သ္ပဂုဏ်တုဲ ဟွံစၟတ်ကေတ် တၚ်ကဠာမကလေၚ်တအ်; ဟွံသေၚ်မ္ဂး ပွမစၠောံတအ်စှ်ေအာမာန်, ၜိုန်နဲကဲကၠောန်ၜိုတ်ယဝ်ဒှ်မံၚ်မသ္ကုၚုဟ်ကီုလေဝ်.",
	"notessubtitles": "ယဝ် 'Import subtitles' ဂှ်စၟတ်တုဲမ္ဂ, Subtitles တအ်ဂှ် စုတ်လဝ်တုဲ, ပါဲနူ ကၠောန်ကေတ်-အလဵုအလဵုမွဲတုဲ.",
	"noteslicensing": "ဆ ပတိုန် {{#a}}#fl|freely licensed{{/a}} or {{#a}}#pd|public domain{{/a}} content. {{#a}}#fu|Fair use{{/a}} ဟွံကဵုအခေါၚ်လ္တူပ္ဍဲ Wikimedia Commons.",
	"extensionmsg": "ပွမချိၚ်သၠဲပတိတ်ဝှာၚ်မတုဲကၠုၚ်လ္တူဂှ် သုၚ်စောဲတုဲ ယဝ် ဟွံသၚ် ယဝ်ဆဒှ် ရုပ်ဒမျိုၚ် မဒှ်ပ္ဍဲနဲကဲကၠောန်ၜိုတ် ဟွံသေၚ်-မသ္ကုၚုဟ်မး, မဒှ်အရာမနွံပၟိက် ချူစၠောံစုတ်. ရုပ်ဒမျိုၚ် ပ္ဍဲနဲကဲကၠောန်ၜိုတ်မသ္ကုၚုဟ်မးတအ် ဆက်ထိၚ်အာ အတိုၚ်မသၠဲပတိတ်တအ်.",
	"confirmmsg": "သ္ပဂုဏ်တုဲ သ္ပဒတန်ကမၠောန်တအ် ဟွံသေၚ် ဍဵု 'Back' သ္ဂောံပြံၚ်ကေတ် ပါရာမဳတာဂမၠိုၚ်. နပွမဍဵုကေတ် 'Confirm', ကမၠောန်တအ် ပတိုန်ပစိုပ်တုဲ သီုကဵု ဂစိုတ်ထောံဏောၚ်. ဒၟာနူကဵု နဲကဲကလေၚ်ဟရောပ်ဒရတ်, ကမၠောန်တအ်လီုလာ်အာဗွဲမလောဲသွာဟွံသေၚ် အခါဍေံဂပ်ဝ် ပတိုန်ပစိုပ်တုဲမ္ဂး."
}
