{
	"@metadata": {
		"authors": [
			"Liuxinyu970226",
			"Purodha",
			"Zhuyifei1999"
		]
	},
	"loginOnCommons": "Plain text shown on a button in the center of the page when the user is logged out. Clicking the link will initialize the OAuth login to [[:commons:|Commons]].\n{{Identical|Log in}}",
	"logout": "Plain text shown on a link on the tool bar. Clicking the link will log the user out.\n{{Identical|Log out}}",
	"help": "Plain text shown on a link on the toolbar next to the logout button. Clicking the link will redirect the browser to the tool's page on Wikimedia Commons.\n{{Identical|Help}}",
	"forkOnGitHub": "Plain text shown on a ribbon on the bottom of the tool webpage. Clicking the ribbon will redirect the browser to the tool's source code on GitHub. [[:w:Fork_(software_development)|Fork]]: usage here is encouraging the user to improve the tool.",
	"JavascriptRequired": "Plain text shown when [[:w:JavaScript|JavaScript]] is not enabled on the user's browser.",
	"abort": "Plain text shown on a button near the progressbar for a running task. Clicking the button will abort the task.\n{{Identical|Abort}}",
	"remove": "Plain text shown on a button near the result text for a completed or errored task. Clicking the button will remove the task from the screen.\n{{Identical|Remove}}",
	"restart": "Plain text shown on a button near the result text for a errored task. Clicking the button will restart the task with the same parameters.\n{{Identical|Restart}}",
	"next": "Plain text shown on a button in the add task dialog. Clicking the button will process the information entered in the dialog and move on to next step.\n{{Identical|Next}}",
	"loading": "Plain text shown when the tool webpage initializes.\n{{Identical|Loading}}",
	"confirm": "Plain text shown on a button in the add task dialog. Clicking the button will process the information entered in the dialog and submit the task to run.\n{{Identical|Confirm}}",
	"errorDisconnect": "Plain text shown in an error box when the tool could not retrieve information from the server.",
	"errorTooLarge": "Semi-plain text shown in the result text for a task errored because the file is too large. There is a link in the text that links to [[:phab:Phabricator|Phabricator]] requesting [[:commons:Special:MyLanguage/Help:Server-side_upload|server-side upload]]. <code><nowiki>{{#a}}</nowiki></code> indicates the start of the link while <code><nowiki>{{/a}}</nowiki></code> indicates the end of the link.",
	"addTask": "Plain text shown on a button at the bottom of the tool webpage. Clicking the button will show the add task dialog.",
	"yourTasks": "Plain text shown near the top of the tool webpage. Below the text is a table of the user's tasks.",
	"createServerSide": "Plain text shown on a button at the bottom of the tool webpage. Clicking the button will redirect the browser to [[:phab:Phabricator|Phabricator]] requesting [[:commons:Special:MyLanguage/Help:Server-side_upload|server-side upload]] for all tasks requiring the upload.",
	"taskDone": "Semi-plain text shown in the result text for a completed task. There is a link in the text that links to the corresponding file page on [[:commons:|Commons]]. <code><nowiki>{{#a}}</nowiki></code> indicates the start of the link while <code><nowiki>{{/a}}</nowiki></code> indicates the end of the link.",
	"cancel": "Plain text shown on a button in the add task dialog. Clicking the button will cancel the add task process and hide the dialog.\n{{Identical|Cancel}}",
	"back": "Plain text shown on a button in the add task dialog. Clicking the button will process the information entered in the dialog and go back to previous step.\n{{Identical|Back}}",
	"extractor": "Plain text shown on the confirm screen (third final step) of the add task dialog. The text after this is the name of the extractor, which is a procedure that extracts information from the site that the task is supposed to work with.\n{{Identical|Extractor}}",
	"keep": "Plain text shown on the confirm screen (third final step) of the add task dialog. The text after this is a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.\n{{Identical|Keep}}",
	"filetarget": "Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the target filename on [[:commons:|Commons]] that the task is supposed to import into.",
	"transcoding": "Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the [[:w:Transcoding|transcoding]] format used when the source media is in a non-[[:w:free format|free format]].",
	"filedescription": "Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the initial [[:commons:Special:MyLanguage/Commons:File description pages|File description page]] used when the task uploads the file.",
	"filename": "Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the initial file name used when the task uploads the file.\n{{Identical|Filename}}",
	"video": "Plain text shown on the confirm screen (third final step) of the add task dialog, in a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.\n{{Identical|Video}}",
	"audio": "Plain text shown on the confirm screen (third final step) of the add task dialog, in a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.\n{{Identical|Audio}}",
	"subtitles": "Plain text shown on the confirm screen (third final step) of the add task dialog, in a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.",
	"keepvideo": "Plain text shown near a checkbox on the source screen (first step) of the add task dialog. Checking the checkbox will make the task keep the video of the source media.",
	"keepaudio": "Plain text shown near a checkbox on the source screen (first step) of the add task dialog. Checking the checkbox will make the task keep the audio of the source media.",
	"importsubtitles": "Plain text shown near a checkbox on the source screen (first step) of the add task dialog. Checking the checkbox will make the task import the subtitles of the source media.",
	"uploadFile": "Plain text shown on a button on the source screen (first step) of the add task dialog. As an alternatve to inputting a file url, pressing the button will create a file selection / upload popup, and start the upload process after a file is chosen.",
	"uploading": "Plain text shown near a progress bar on the source screen (first step) of the add task dialog. The progress bar indicates the current upload progress percentage.\n{{Identical|Uploading}}",
	"note": "Plain text shown in the add task dialog. Following it are some bullet-point notes about the dialog that the user is supposed to know.\n{{Identical|Note}}",
	"importantnote": "Bold plain text shown on the source screen (first step) of the add task dialog after the other notes. The note after this is to warn the user of [[:commons:|Commons]]'s [[:commons:Special:MyLanguage/Commons:Licensing|Licensing]]",
	"notesplaylists": "Plain text shown as a note on the source screen (first step) of the add task dialog. Youku and Comedy Central are both video sites.",
	"notesuncheck": "Plain text shown as a note on the source screen (first step) of the add task dialog.",
	"notessubtitles": "Plain text shown as a note on the source screen (first step) of the add task dialog.",
	"noteslicensing": "Semi-plain text shown as the importent note on the source screen (first step) of the add task dialog. There are some links in the text: [[:commons:Commons:Licensing#Acceptable_licenses|freely licensed]], [[:commons:Commons:Licensing#Material_in_the_public_domain|public domain]], [[:commons:Commons:FU|fair use]]. <code><nowiki>{{#a}}</nowiki></code> indicates the start of the link while <code><nowiki>{{/a}}</nowiki></code> indicates the end of the link, and <code><nowiki>#??|</nowiki></code> are the identifier of the link, which should not be changed.",
	"extensionmsg": "Plain text shown as a note on the destination screen (second step) of the add task dialog. Terms: [[:w:Transcoding|transcoding]], [[:w:free format|free format]].",
	"confirmmsg": "Plain text shown as a note on the confirm screen (third final step) of the add task dialog."
}
