{
	"abort"             :"Plain text shown on a button near the progressbar for a running task. Clicking the button will abort the task.",
	"remove"            :"Plain text shown on a button near the result text for a completed or errored task. Clicking the button will remove the task from the screen.",
	"restart"           :"Plain text shown on a button near the result text for a errored task. Clicking the button will restart the task with the same parameters.",
	"next"              :"Plain text shown on a button in the add task dialog. Clicking the button will process the information entered in the dialog and move on to next step.",
	"loading"           :"Plain text shown when the tool webpage initializes.",
	"confirm"           :"Plain text shown on a button in the add task dialog. Clicking the button will process the information entered in the dialog and submit the task to run.",
	"errorDisconnect"   :"Plain text shown in an error box when the tool could not retrieve information from the server.",
	"errorTooLarge"     :"Semi-plain text shown in the result text for a task errored because of the being too large. There is a link in the text that links to [[:phab:Phabricator|Phabricator]] requesting [[:commons:Special:MyLanguage/Help:Server-side_upload|server-side upload]]. <code><nowiki>{{#a}}</nowiki></code> indicates the start of the link while <code><nowiki>{{/a}}</nowiki></code> indicates the end of the link.",
	"addTask"           :"Plain text shown on a button at the bottom of the tool webpage. Clicking the button will show the add task dialog.",
	"yourTasks"         :"Plain text shown near the top of the tool webpage. Below the text is a table of the user's tasks.",
	"createServerSide"  :"Plain text shown on a button at the bottom of the tool webpage. Clicking the button will redirect the browser to [[:phab:Phabricator|Phabricator]] requesting [[:commons:Special:MyLanguage/Help:Server-side_upload|server-side upload]] for all tasks requiring the upload.",
	"taskDone"          :"Semi-plain text shown in the result text for a completed task. There is a link in the text that links to the corresponding file page on [[:commons:|Commons]]. <code><nowiki>{{#a}}</nowiki></code> indicates the start of the link while <code><nowiki>{{/a}}</nowiki></code> indicates the end of the link.",
	"cancel"            :"Plain text shown on a button in the add task dialog. Clicking the button will cancel the add task process and hide the dialog.",
	"back"              :"Plain text shown on a button in the add task dialog. Clicking the button will process the information entered in the dialog and go back to previous step.",
	"extractor"         :"Plain text shown on the confirm screen (third final step) of the add task dialog. The text after this is the name of the extractor, which is a procedure that extracts information from the site that the task is supposed to work with.",
	"keep"              :"Plain text shown on the confirm screen (third final step) of the add task dialog. The text after this is a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.",
	"filetarget"        :"Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the target filename on [[:commons:|Commons]] that the task is supposed to import into.",
	"transcoding"       :"Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the [[:wikt:transcode|transcoding]] format used when the source media is in a non-[[:w:free format|free format]].",
	"filedescription"   :"Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the initial [[:commons:Special:MyLanguage/Commons:File description pages|File description page]] used when the task uploads the file.",
	"filename"          :"Plain text shown on the destination screen (second step) and the confirm screen (third final step) of the add task dialog. The text after this is the initial file name used when the task uploads the file.",
	"video"             :"Plain text shown on the confirm screen (third final step) of the add task dialog, in a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.",
	"audio"             :"Plain text shown on the confirm screen (third final step) of the add task dialog, in a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.",
	"subtitles"         :"Plain text shown on the confirm screen (third final step) of the add task dialog, in a comma seperated subset of video, audio, subtitles. The subset shows what parts of the source media are the task supposed to keep.",
	"keepvideo"         :"Plain text shown near a checkbox on the source screen (first step) of the add task dialog. Checking the checkbox will make the task keep the video of the source media.",
	"keepaudio"         :"Plain text shown near a checkbox on the source screen (first step) of the add task dialog. Checking the checkbox will make the task keep the audio of the source media.",
	"importsubtitles"   :"Plain text shown near a checkbox on the source screen (first step) of the add task dialog. Checking the checkbox will make the task import the subtitles of the source media.",
	"note"              :"Plain text shown in the add task dialog. Following it is some bullet-point notes about the dialog that the user is supposed to know.",
	"importantnote"     :"Bold plain text shown on the source screen (first step) of the add task dialog after the other notes. The note after this is to warn the user of [[:commons:|Commons]]'s [[:commons:Special:MyLanguage/Commons:Licensing|Licensing]]",
	"notesplaylists"    :"Plain text shown as a note on the source screen (first step) of the add task dialog. Youku and Comedy Central are both video sites.",
	"notesuncheck"      :"Plain text shown as a note on the source screen (first step) of the add task dialog.",
	"notessubtitles"    :"Plain text shown as a note on the source screen (first step) of the add task dialog.",
	"notesown"          :"Semi-plain text shown as a note on the source screen (first step) of the add task dialog. There is a link in the text that links to [[:toollabs:videoconvert|the videoconvert tool on toollabs]]. <code><nowiki>{{#a}}</nowiki></code> indicates the start of the link while <code><nowiki>{{/a}}</nowiki></code> indicates the end of the link, and <code><nowiki>#vc|</nowiki></code> is the identifier of the link, which should not be changed. Terms: [[:wikitech:Help:Tool Labs|Tool Labs]], [[:w:Network File System]], [[:wikitech:Help:Tool_Labs#The_grid|Grid engine]].",
	"noteslicensing"    :"Semi-plain text shown as the importent note on the source screen (first step) of the add task dialog. There are some links in the text: [[:commons:Commons:Licensing#Acceptable_licenses|freely licensed]], [[:commons:Commons:Licensing#Material_in_the_public_domain|public domain]], [[:commons:Commons:FU|fair use]]. <code><nowiki>{{#a}}</nowiki></code> indicates the start of the link while <code><nowiki>{{/a}}</nowiki></code> indicates the end of the link, and <code><nowiki>#??|</nowiki></code> are the identifier of the link, which should not be changed.",
	"extensionmsg"      :"Plain text shown as a note on the destination screen (second step) of the add task dialog. Terms: [[:wikt:transcode|transcoding]], [[:w:free format|free format]].",
	"confirmmsg"        :"Plain text shown as a note on the confirm screen (third final step) of the add task dialog."
}
