{
	"@metadata": {
		"authors": [
			"L2212"
		]
	},
	"loginOnCommons": "Intra in Wikimedia Commons",
	"logout": "Essi",
	"help": "Agiudu",
	"forkOnGitHub": "Forka·mi in GitHub",
	"JavascriptRequired": "JavaScript est netzessàriu pro impreare custu trastu!",
	"abort": "Firma",
	"remove": "Boga",
	"restart": "Torra a aviare",
	"next": "Sighi",
	"loading": "Carrighende...",
	"confirm": "Cunfirma",
	"errorDisconnect": "Sa connessione a su server est fallida. Pro praghere torra a agiornare sa pàgina o aberi una sinnalatzione de errore in GitHub.",
	"errorTooLarge": "Su documentu est tropu mannu pro lu carrigare diretamente! Dias pòdere {{#a}}pedire unu carrigamentu dae s'ala de su server{{/a}}.",
	"addTask": "Annanghe una faina...",
	"yourTasks": "Sas fainas tuas:",
	"createServerSide": "Crea unu billete de carrigamentu ala-server in unu passu ebbia (cussigiadu)",
	"taskDone": "Sa faina tua est acabada. Podes agatare su carrigamentu tuo in {{#a}}{{/a}}.",
	"cancel": "Annulla",
	"back": "In segus",
	"extractor": "Estraidore",
	"keep": "Mantènnere",
	"filetarget": "Nùmene de su documentu de destinatzione",
	"transcoding": "Formadu de transcodìfica",
	"filedescription": "Pàgina de descritzione de su documentu",
	"filename": "Nùmene de su documentu",
	"video": "vìdeu",
	"audio": "àudio",
	"subtitles": "sutatìtulos",
	"keepvideo": "Mantene su vìdeu",
	"keepaudio": "Mantene s'àudio",
	"importsubtitles": "Importa sos sutatìtulos",
	"uploadFile": "O càrriga unu documentu...",
	"uploading": "Carrighende...",
	"note": "Nota:",
	"importantnote": "Nota de importu:",
	"notesplaylists": "Sas iscalitas no ant a èssere elaboradas in manera curreta. Carchi situ (comente a Youku o Comedy Central) impreat vìdeos cun prus funtzionalidades, interpretados comente a iscalitas, chi no ant a bènnere elaborados in manera curreta nemmancu issos.",
	"notesuncheck": "Si su documentu multimediale no includet rastas vìdeu o àudio, boga s'ispunta dae sas casellas chi li currispondent; si nono sa cunversione diat pòdere fallire fintzas si su formadu est lìberu.",
	"notessubtitles": "Si ‘Importa sutatìtulos’ est ispuntada, sos sutatìtulos, francu cussos generados in manera automàtica, ant a bènnere importados.",
	"noteslicensing": "Càrriga petzi cuntenutos cun {{#a}}#fl|lissèntzia lìbera{{/a}} o de {{#a}}#pd|pùblicu domìniu{{/a}}. S'{{#a}}#fu|“impreu leale (fair use)”{{/a/} no est cunsentidu in Wikimedia Commons.",
	"extensionmsg": "S'estensione de documentu impostada inoghe in subra at a bènnere impreada petzi si su vìdeu est in unu formadu non lìberu, chi tenet bisòngiu de una transcodìfica. Sos vìdeos in formadu lìberu ant a mantènnere s'estensione issoro.",
	"confirmmsg": "Pro praghere cunfirma sa faina o incarca ‘In dae segus’ pro modificare sos paràmetros. Incarchende ‘Cunfirma’, sa faina at a bènnere cunsignada e esecutada. Pro more de de limitatziones tècnicas, una faina non podet èssere annullada in manera fàtzile a pustis chi est istada cunsignada."
}
