{
	"@metadata": {
		"authors": [
			"Leducthn"
		]
	},
	"loginOnCommons": "Đăng nhập tại Wikimedia Commons",
	"logout": "Đăng xuất",
	"help": "Trợ giúp",
	"forkOnGitHub": "Truy cập mã nguồn trên GitHub",
	"JavascriptRequired": "Công cụ này cần có JavaScript thì mới hoạt động được!",
	"abort": "Gián đoạn",
	"remove": "Xoá",
	"restart": "Khởi động lại",
	"next": "Tiếp theo",
	"loading": "Đang tải…",
	"confirm": "Xác nhận",
	"errorDisconnect": "Kết nối tới may chủ thất/bại. Hãy thử tải lại trang hoặc báo cáo vấn đề trên GitHub.",
	"errorTooLarge": "Tập tin quá lớn nên không thể tải lên trực tiếp được! Bạn có thể {{#a}}yêu cầu tải lên từ phía máy chủ (server-side upload){{/a}}",
	"addTask": "Thêm việc...",
	"yourTasks": "Các việc của bạn:",
	"createServerSide": "Tạo yêu cầu tải lên từ phía máy chủ (server-side upload) một lần (nên dùng)",
	"taskDone": "Công việc của bạn đã hoàn thành. Bạn có thể xem tập tin đã tải lên tại {{#a}}{{/a}}.",
	"cancel": "Hủy bỏ",
	"back": "Trở lại",
	"keep": "Giữ",
	"filedescription": "Miêu tả tập tin",
	"filename": "Tên tập tin",
	"video": "video",
	"audio": "âm thanh",
	"subtitles": "phụ đề",
	"keepvideo": "Giữ video",
	"keepaudio": "Giữ âm thanh",
	"importsubtitles": "Nhập phụ đề",
	"uploadFile": "Hoặc tải lên...",
	"uploading": "Đang tải lên...",
	"note": "Lưu ý:",
	"importantnote": "Lưu ý quan trọng:",
	"notesplaylists": "Danh sách phát sẽ không được xử lí đúng cách. Có vài trang như Youku hay Comedy Central tạo các \"video nhiều phần\" và coi đó như một danh sách phát, và \"danh sách phát\" như vậy cũng sẽ không được xử lí đúng cách.",
	"notesuncheck": "Nếu tập tin đa phương tiện không có video hay đoạn âm thanh, vui lòng bỏ chọn các lựa chọn tương đương; nếu không thì việc chuyển đổi có thể thất bại cho dù định dạng tập tin có phải là định dạng tự do hay không.",
	"notessubtitles": "Khi chọn 'Nhập phụ đề', phụ đề (trừ các phụ đề tự động do máy tạo) sẽ được nhập vào.",
	"extensionmsg": "Định dạng tập tin đặt ở trên sẽ chỉ được sử dụng khi video không phải là một định dạng tự do. Các video như thế sẽ được chuyển đổi sang định dạng tự do trên. Các video có định dạng tự do giữ nguyên định dạng ấy.",
	"confirmmsg": "Xin hãy xác nhận công việc hoặc bấm 'Trở về' để điều chỉnh thông số nếu cần. Khi nhấn 'Xác nhận', công việc sẽ được gửi và sẽ được thực thi. Vì hạn chế kĩ thuật, một công việc khi đã gửi thì khó mà huỷ giữa chừng được."
}
